In [89]:
import pandas as pd

In [90]:
path1 = "Resources/schools_complete.csv"
path2 = "Resources/students_complete.csv"

In [91]:
schools = pd.read_csv(path1)
students = pd.read_csv(path2)

In [92]:
schools.columns

Index(['School ID', 'school_name', 'type', 'size', 'budget'], dtype='object')

In [93]:
students.columns

Index(['Student ID', 'student_name', 'gender', 'year', 'school_name',
       'reading_score', 'maths_score'],
      dtype='object')

In [94]:
df = pd.merge(schools,students, on="school_name", how="outer")
df.head()

,School ID,school_name,type,size,budget,Student ID,student_name,gender,year,reading_score,maths_score
0,0,Huang High School,Government,2917,1910635,0,Paul Bradley,M,9,96,94
1,0,Huang High School,Government,2917,1910635,1,Victor Smith,M,12,90,43
2,0,Huang High School,Government,2917,1910635,2,Kevin Rodriguez,M,12,41,76
3,0,Huang High School,Government,2917,1910635,3,Richard Scott,M,12,89,86
4,0,Huang High School,Government,2917,1910635,4,Bonnie Ray,F,9,87,69

In [95]:
schools_list = df["school_name"].value_counts()
schools_list

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: school_name, dtype: int64

In [96]:
#Total number of unique schools
unq_sch = len(schools_list)
unq_sch

15

In [97]:
# Total students
stu_count = len(df["student_name"])
stu_count

39170

In [98]:
#Total budget
budget_df = df.drop_duplicates(subset=["school_name"],ignore_index=True)
budget_df = budget_df[["school_name","budget"]]
budget_df
total_budget = budget_df["budget"].sum()
total_budget

24649428

In [99]:
df.dtypes

School ID         int64
school_name      object
type             object
size              int64
budget            int64
Student ID        int64
student_name     object
gender           object
year              int64
reading_score     int64
maths_score       int64
dtype: object

In [100]:
#Average maths score
total_maths = df["maths_score"]
avg_maths = total_maths.mean()
avg_maths

70.33819249425581

In [101]:
# Average reading score
total_reading = df["reading_score"]
avg_reading = total_reading.mean()
avg_reading

69.98013786060761

In [102]:
# % passing maths (the percentage of students who passed maths)

pass_maths = df.loc[df["maths_score"]>=50,:]
pass_maths
pass_count = pass_maths["maths_score"].count()
pass_count
rate_pass_maths = pass_count/stu_count *100
rate_pass_maths

86.07863160582077

In [103]:
#% passing reading (the percentage of students who passed reading)
pass_reading = df.loc[df["reading_score"]>=50,:]
pass_reading
passRd_count = pass_reading["reading_score"].count()
passRd_count
rate_pass_reading = passRd_count/stu_count *100
rate_pass_reading

84.42685728874139

In [104]:
# % overall passing (the percentage of students who passed maths AND reading)
pass_df = df.loc[(df["maths_score"]>=50)&(df["reading_score"]>=50),:]
pass_df
ovPass_count = pass_df["student_name"].count()
ovPass_count
ovPass_rate = ovPass_count/stu_count *100
ovPass_rate

72.80827163645647

In [105]:
#LGA Summary metrics
lga_df = pd.DataFrame({"Total Schools":unq_sch,"Total Students":stu_count},index=[0])

lga_df

   Total Schools  Total Students
0             15           39170

In [106]:
lga_df["Total Budget"]=total_budget
lga_df

   Total Schools  Total Students  Total Budget
0             15           39170      24649428

In [107]:
lga_df["Average Maths Score"]=avg_maths
lga_df

   Total Schools  Total Students  Total Budget  Average Maths Score
0             15           39170      24649428            70.338192

In [108]:
lga_df["Average Reading Score"]=avg_reading
lga_df

,Total Schools,Total Students,Total Budget,Average Maths Score,Average Reading Score
0,15,39170,24649428,70.338192,69.980138

In [109]:
lga_df["% Passing Maths"]=rate_pass_maths
lga_df

,Total Schools,Total Students,Total Budget,Average Maths Score,Average Reading Score,% Passing Maths
0,15,39170,24649428,70.338192,69.980138,86.078632

In [110]:
lga_df["% Passing Reading"]=rate_pass_reading
lga_df

,Total Schools,Total Students,Total Budget,Average Maths Score,Average Reading Score,% Passing Maths,% Passing Reading
0,15,39170,24649428,70.338192,69.980138,86.078632,84.426857

In [111]:
lga_df["% Overall Passing"]=ovPass_rate
lga_df

,Total Schools,Total Students,Total Budget,Average Maths Score,Average Reading Score,% Passing Maths,% Passing Reading,% Overall Passing
0,15,39170,24649428,70.338192,69.980138,86.078632,84.426857,72.808272

In [119]:
# Formatting
lga_df["Total Students"] = lga_df["Total Students"].map("{:,}".format)
#lga_df["Total Budget"] = lga_df["Total Budget"].map("${:,.2f}".format)
#lga_df["Average Maths Score"] = lga_df["Average Maths Score"].map("{:.2f}".format)
#lga_df["Average Reading Score"] = lga_df["Average Reading Score"].map("{:.2f}".format)
lga_df["% Passing Maths"] = lga_df["% Passing Maths"].map("{:.2f}%".format)
lga_df["% Passing Reading"] = lga_df["% Passing Reading"].map("{:.2f}%".format)
lga_df["% Overall Passing"] = lga_df["% Overall Passing"].map("{:.2f}%".format)
lga_df

,Total Schools,Total Students,Total Budget,Average Maths Score,Average Reading Score,% Passing Maths,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",70.34,69.98,86.08%,84.43%,72.81%